Revit 2026 API

# UISaveAsOptions Properties

---

The UISaveAsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowOverwriteWarning | Identifies if UI should show an overwrite warning dialog. |

#### Reference

UISaveAsOptions Class

Autodesk.Revit.UI Namespace